---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameter.IsInstance
source: html/89631a31-f16e-4693-0374-88a39722bde8.htm
---
# Autodesk.Revit.DB.FamilyParameter.IsInstance Property

Indicates if the parameter is instance or type.

## Syntax (C#)
```csharp
public bool IsInstance { get; }
```